Revit 2027 API
View.GetReferenceCallouts Method
 Returns element ids of all reference callouts in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetReferenceCallouts()
Public Function GetReferenceCallouts As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetReferenceCallouts()
member GetReferenceCallouts : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Element ids of all reference callouts in the view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace